export const accordionItems = [
    {
        id: 1,
        title: "Как проходит весь процесс оптимизации?",
        content: "Мы проводим диагностику, настраиваем систему, очищаем её от ненужных файлов и проверяем результат.",
    },
    {
        id: 2,
        title: "Какой результат я получу после оптимизации?",
        content: "Полностью настроенную, чистую и оптимизированную систему, раскрытие потенциала ваших комплектующих до максимума, повышение ФПС, понижение задержки и понижение пинга во всех играх.",
    },
    {
        id: 3,
        title: "Нужно ли оставлять ПК во время оптимизации?",
        content: "Оптимизация проходит через программу AnyDesk. Вам нужно всего лишь нажать одну кнопку, а наш специалист сделает всё остальное. Вы можете расслабиться и наслаждаться процессом!",
    },
];
export default accordionItems;