export const accordionItems = [
    {
        id: 1,
        title: "Как проходит оптимизация?",
        content: "Мы проводим диагностику, настраиваем систему, очищаем её от лишнего и проверяем результат.",
    },
    {
        id: 2,
        title: "Какой результат я получу?",
        content: "Полностью настроенную, чистую и оптимизированную систему, раскрытие потенциала ваших комплектующих до максимума, повышение ФПС, понижение задержки и понижение пинга во всех играх.",
    },
    {
        id: 3,
        title: "Нужно ли оставлять ПК?",
        content: "Вся оптимизация проходит через программу AnyDesk. От вас потребуется нажать на одну кнопку, а дальше все сделает наш специалист. Вы просто сидите и наслаждаетесь процессом",
    },
];
export default accordionItems;