export const banner = [
    {
        id: 1,
        content: [
            `
            Увеличение FPS, которое я наблюдал, наглядно подтверждает, что оптимизация CleanTweaking более чем оправдана. Я буду рекомендовать данных людей всем, кто заинтересован в значительном улучшении производительности своих систем.
            `
        ],
        title: 'Алекс'
    },
    {
        id: 2,
        content: [
            `
            Отлично информирован, высокоэффективен и замечательный собеседник. Я не очень разбираюсь в ПК, и это моя первая сборка. Они уделили время, чтобы объяснить мне все детали и научить тому, о чем я даже не догадывался. Очень рекомендую и уже посоветовал это место своим знакомым и друзьям.
            `
        ],
        title: 'Евгений'
    },
    {
        id: 3,
        content: [
            `
            Я был впечатлён сервисом CleanTweaking. Оптимизация прошла легко, специалисты подробно объяснили все этапы и ответили на мои вопросы. Результаты превзошли ожидания, и производительность заметно улучшилась. Рекомендую CleanTweaking всем, кто хочет улучшить свой ПК!
            `
        ],
        title: 'Максим'
    },
];

export default banner;