export const reviews = [
    {
        name: "Анатолий",
        review: "Хорошая оптимизация ПК, был импут-лаг и просадки. Сейчас все стало хорошо, максимально понятно. Я доволен.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Данил",
        review: "Играю в Valorant. Были просадки с 280 до 150 фпс, теперь просадки только до 220 (на 240 Гц). Все просто замечательно.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Савелий",
        review: "Хороший и качественный буст, человек — мастер своего дела. Лично у меня +150 фпс и уменьшение импут-лага.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Евгений",
        review: "Очень хороший буст фпс, КС стала намного плавнее, инпут-лаг уменьшился, человек разбирается в оптимизации.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Владислав",
        review: "Оптимизировал компьютер, стало плавнее играть и стримить параллельно. Фпс прыгал от 260 до 300, стал стабильно 400.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Роман",
        review: "Очень сильно помог, фпс увеличился вдвое, картинка стала в сотни раз плавнее, пропал инпут-лаг. Очень благодарен ему, +rep.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Никита",
        review: "Нереально помог, всем советую. Всё четко и по делу объяснил, +100 фпс, еще и помог настроить OBS. Очень приятный человек, настоящий профессионал своего дела.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Дмитрий",
        review: "Отлично, настроил ПК, объяснил все по полочкам. Мало сейчас таких людей, всем советую данного специалиста.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Антон",
        review: "Хорошая оптимизация, мне понравилась. Играю, чувствую себя как в реальности, все круто, рекомендую.",
        stars: "⭐⭐⭐⭐⭐"
    }
];
export default reviews;
