export const reviews = [
    {
        name: "Анатолий",
        review: "Хорошая оптимизация пк, был импут лаг, посадки. Щас все стало хорошо, максимально понятно. Я доволен.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Данил",
        review: "Игра валорант. Были просадки с 280 до 150+- фпс, теперь просадки только до 220+- (на 240 герц). Все просто замечательно.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Савелий",
        review: "Хороший и качественный буст , человек мастер своего дела . Лично у меня + 150 фпс и уменьшение импутлага.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Евгений",
        review: "Очень хороший и очень буст фпс, кс стала намного плвнее инпут стал меньше, человек шарит за оптимизацию.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Владислав",
        review: "Оптимизировал комп, стало плавнее играть и стримить параллельно, прыгал вар и фпс был 260-300, стал стабильно 400.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Роман",
        review: "очень сильно помог, фпс увеличился вдвое, картинка стала в сотни раз плавнее, пропал инпутлаг, очень благодарен ему +rep.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Никита",
        review: "Нереально помог, всем советую. Всë четко и по делу объяснил, + 100 фпс, еще и помог обс настроить\n" +
            "Очень приятный человек, настоящий профессионал своего дела.",
        stars: "⭐⭐⭐⭐"
    },
    {
        name: "Дмитрий",
        review: "Отлично, настроил ПК, сказал всё как делать по полочкам, мало сейчас таких людей, всем советую данного человека.",
        stars: "⭐⭐⭐⭐⭐"
    },
    {
        name: "Антон",
        review: "Хорошая оптимизация мне понравилась игру чувтсвую как в реальности все круто рекомендую.",
        stars: "⭐⭐⭐⭐⭐"
    }
];
export default reviews;