export const security = [
    {
        id: 1,
        number: '1/8',
        title: 'Обновление Windows',
        description: 'Обновление операционной системы до последней версии является важным шагом в оптимизации. Это не только улучшает безопасность, но и обеспечивает доступ к новым функциям и улучшениям производительности, что позволяет системе работать более эффективно.'
    },
    {
        id: 2,
        number: '2/8',
        title: 'Переустановка драйверов видеокарты',
        description: 'Устаревшие или поврежденные драйверы видеокарты могут значительно снизить производительность. Переустановка драйверов гарантирует оптимальную работу графической подсистемы и улучшает качество отображения, что особенно важно для игр и графически интенсивных приложений.',
    },
    {
        id: 3,
        number: '3/8',
        title: 'Удаление антивирусного ПО',
        description: `В некоторых случаях антивирусные программы могут замедлять работу системы. Удаление антивируса в безопасном режиме и повторная проверка производительности без него могут помочь выявить возможные конфликты и улучшить общую скорость работы ПК.`,
    },
    {
        id: 4,
        number: '4/8',
        title: 'Установка необходимых программ',
        description: 'Установка и обновление всех необходимых программ, включая драйверы и утилиты, обеспечивают корректную работу системы. Это включает в себя приложения, используемые для работы и развлечений, что способствует более плавной и быстрой работе.',
    },
    {
        id: 5,
        number: '5/8',
        title: 'Настройка панелей управления',
        description: 'Оптимизация настроек в Control Panel NVIDIA, Steam, Discord, OBS и других приложениях позволяет достичь наилучшей производительности. Правильная настройка графики и параметров производительности помогает адаптировать систему под конкретные задачи.',
    },
    {
        id: 6,
        number: '6/8',
        title: 'Обновление драйвера интернета',
        description: 'Обновление драйверов сетевого адаптера улучшает скорость и стабильность интернет-соединения. Это особенно важно для онлайн-игр и потокового видео, где стабильное соединение критично для комфортного использования.',
    },
    {
        id: 7,
        number: '7/8',
        title: 'Очистка и оптимизация дисков',
        description: 'Очистка дисков от временных файлов и ненужных данных, а также отключение индексации, помогает освободить место и улучшить скорость доступа к данным. Это способствует более быстрой загрузке приложений и файлов.',
    },
    {
        id: 8,
        number: '8/8',
        title: 'Настройка параметров Windows и служб',
        description: 'Отключение ненужных параметров Windows и проверка служб, работающих в фоновом режиме, позволяют снизить нагрузку на систему. Это освобождает ресурсы и улучшает общую производительность, что делает работу более эффективной.',
    },
]

export default security;