export const security = [
    {
        id: 1,
        number: '1/7',
        title: 'Обновление Windows',
        description: 'Обновление ОС до последней версии улучшает безопасность и производительность, позволяя системе работать эффективнее.'
    },
    {
        id: 2,
        number: '2/7',
        title: 'Переустановка драйверов',
        description: 'Устаревшие или поврежденные драйверы снижают производительность. Переустановка обеспечивает оптимальную работу системы и улучшает интернет-соединение для игр и работы.'
    },
    {
        id: 3,
        number: '3/7',
        title: 'Отключение антивирусного ПО',
        description: `Антивирусные программы могут замедлять систему. Отключение антивируса в безопасном режиме и проверка производительности без него помогут выявить конфликты и улучшить скорость работы ПК.`,
    },
    {
        id: 4,
        number: '4/7',
        title: 'Установка необходимых программ',
        description: 'Установка и обновление всех необходимых программ и драйверов обеспечивают корректную работу системы, способствуя более плавной и быстрой работе.',
    },
    {
        id: 5,
        number: '5/7',
        title: 'Настройка приложений',
        description: 'Настройка Steam, Discord, OBS и других приложений позволяет достичь наилучшей производительности, адаптируя систему под конкретные задачи.',
    },
    {
        id: 6,
        number: '6/7',
        title: 'Очистка и оптимизация дисков',
        description: 'Очистка временных файлов и отключение индексации освобождают место и улучшают скорость доступа, способствуя быстрой загрузке приложений и файлов.',
    },
    {
        id: 7,
        number: '7/7',
        title: 'Настройка параметров Windows и служб',
        description: 'Настройка реестра, параметров Windows и отключение фоновых служб освобождают ресурсы, улучшая быстродействие и общую производительность для более эффективной работы и игр.',
    },
]

export default security;
