export const security = [
    {
        id: 1,
        number: '1/7',
        title: 'Обновление Windows',
        description: 'Обновление операционной системы до последней версии является важным шагом в оптимизации. Это не только улучшает безопасность, но и обеспечивает доступ к новым функциям и улучшениям производительности, что позволяет системе работать более эффективно.'
    },
    {
        id: 2,
        number: '2/7',
        title: 'Переустановка драйверов',
        description: 'Устаревшие или поврежденные драйверы, включая видеокарты и сетевые адаптеры, могут снижать производительность. Переустановка драйверов обеспечивает оптимальную работу системы и улучшает качество интернет-соединения, что особенно важно для игр и рабочих задач.'
    },
    {
        id: 3,
        number: '3/7',
        title: 'Удаление антивирусного ПО',
        description: `В некоторых случаях антивирусные программы могут замедлять работу системы. Удаление антивируса в безопасном режиме и повторная проверка производительности без него могут помочь выявить возможные конфликты и улучшить общую скорость работы ПК.`,
    },
    {
        id: 4,
        number: '4/7',
        title: 'Установка необходимых программ',
        description: 'Установка и обновление всех необходимых программ, включая драйверы и утилиты, обеспечивают корректную работу системы. Это включает в себя приложения, используемые для работы и развлечений, что способствует более плавной и быстрой работе.',
    },
    {
        id: 5,
        number: '5/7',
        title: 'Настройка приложений',
        description: 'Оптимизация настроек в Steam, Discord, OBS и других приложениях позволяет достичь наилучшей производительности. Правильная настройка параметров производительности помогает адаптировать систему под конкретные задачи.',
    },
    {
        id: 6,
        number: '6/7',
        title: 'Очистка и оптимизация дисков',
        description: 'Очистка дисков от временных файлов и ненужных данных, а также отключение индексации, помогает освободить место и улучшить скорость доступа к данным. Это способствует более быстрой загрузке приложений и файлов.',
    },
    {
        id: 7,
        number: '7/7',
        title: 'Настройка параметров Windows и служб',
        description: 'Настройка реестра, настройка параметров Windows, отключение служб и автозагрузок, работающих в фоновом режиме. Это освобождает системные ресурсы, улучшает быстродействие и общую производительность системы, что сделает ваш игровой опыт и работу более эффективными.',
    },
]

export default security;
