import lock from '@/assets/icons/lock.svg';
import love from '@/assets/icons/love.svg';
import tick from '@/assets/icons/tick.svg';
import money from '@/assets/icons/money.svg';

import services1 from "@/assets/images/services1.jpg";
import services2 from "@/assets/images/services2.jpg";
import services3 from "@/assets/images/services3.jpg";

export const servicesIcons = [
    {
        id: 1,
        src: lock,
        alt: 'Lock Icon',
        title: 'Ваша конфиденциальность в безопасности',
        description: 'Мы придаем огромное значение вашей конфиденциальности. Наши технические специалисты никогда не будут просматривать или работать с вашими личными файлами и папками. Мы гарантируем, что все ваши данные остаются под надежной защитой.'
    },
    {
        id: 2,
        src: love,
        alt: 'Love Icon',
        title: 'Защита данных на первом месте',
        description: 'Мы используем современные технологии и методы для обеспечения безопасности ваших данных. Все процессы выполняются с соблюдением строгих стандартов безопасности, что позволяет минимизировать риски утечки информации.'
    },
    {
        id: 3,
        src: tick,
        alt: 'Tick Icon',
        title: 'Прозрачность действий',
        description: 'Мы стремимся к полной прозрачности в нашей работе. Вы всегда будете информированы о том, что именно происходит с вашим компьютером и какие действия предпринимаются. Это создает доверие и уверенность в том, что ваши данные находятся в надежных руках.'
    },
    {
        id: 4,
        src: money,
        alt: 'Money Icon',
        title: 'Гарантия удовлетворения',
        description: 'Мы уверены в качестве наших услуг и предлагаем 7-дневную гарантию возврата денег. Если вы не будете довольны результатом, мы вернем ваши средства, что подтверждает нашу приверженность к высокому уровню обслуживания и защите ваших интересов.'
    }
];

export const servicesImg = [
    {
        id: 1,
        src: services1,
        alt: 'Service 1 Image',
        title: 'Производительность',
        description: 'Наши специалисты разгрузят, очистят и оптимизируют ваш компьютер для достижения максимальной производительности. Мы сделаем это быстро, профессионально и прозрачно, чтобы вы могли наслаждаться ускоренной работой системы.'
    },
    {
        id: 2,
        src: services2,
        alt: 'Service 2 Image',
        title: 'Стабильность',
        description: 'Эта услуга обеспечивает повышенную стабильность, благодаря полной проверке состояния вашего ПК, обновлению драйверов и профессиональным рекомендациям. Мы гарантируем, что ваш компьютер будет работать без сбоев.'
    },
    {
        id: 3,
        src: services3,
        alt: 'Service 3 Image',
        title: 'Удобство',
        description: 'Сделайте все правильно с первого раза, быстро и с помощью людей, которые делали это множество раз. Одна оптимизация, и вы сразу же ощутите прирост производительности, что сделает вашу работу более комфортной и эффективной.'
    },
];
